tutorials-OpenFOAM-10/reverseBurner-chtMultiRegionFoamLTS/0/gas/Qdot
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/gas";
    object      Qdot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletFuel
    {
        type            calculated;
        value           uniform 0;
    }
    inletAir
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    wedgeNeg
    {
        type            wedge;
    }
    wedgePos
    {
        type            wedge;
    }
    gas_to_solid
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
